problems met/latex/chinese_fontawesome_color.en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Use Chinese, fontawesome and custom color in Latex</title>
<!-- 2017-02-14 Tue 23:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Junjun Shi" />
</head>
<body>
<div id="content">
<h1 class="title">Use Chinese, fontawesome and custom color in Latex</h1>
<p>
The environment I am using is Macbook Air, OSX 10.11.6, Mactex 2016. Compile file with XeLaTex.
</p>

<ol class="org-ol">
<li>How to use Chinese characters under Latex
Using the LaTex file from <i>learnxinyminutes</i> directly, the output file will miss the Chinese characters. (actually I just want something to start)
<div class="org-src-container">

<pre class="src src-latex">\usepackage[UTF8]{ctex}
\usepackage{CJKutf8}
</pre>
</div>
<p>
What I used in my document is the former one, the second should work, but I have never tried.
Attention: I used the xelatex to compile the file.
</p>
</li>

<li>How to use the fontawesome
Under my circumstance, it will throw out the error that unable to load the fontawesome if I use it directly. So after I searched, I need to add the Path of fontawesome manually.
<div class="org-src-container">

<pre class="src src-latex">\usepackage{fontspec}
\defaultfontfeatures{
    Path = /usr/local/texlive/2016/texmf-dist/fonts/opentype/public/fontawesome/ }
\usepackage{fontawesome}
</pre>
</div>
<p>
I am using the MacTex 2016 edition. You can edit the number in the Path, and it should work now.
</p>
</li>

<li>Use custom color
When I use LaTex, I could not find some of the color, so I tried to find out use custom colors, and here is a site to find the corresponding color:<a href="http://latexcolor.com/">http://latexcolor.com/</a>
<div class="org-src-container">

<pre class="src src-latex">\usepackage{color}
\definecolor{mustard}{rgb}{1.0, 0.86, 0.35}
\color{mustard}Mustard
</pre>
</div>
<p>
In the example, I defined the mustard color(Not WASABI), once defined, you can use as the default colors.
</p>
</li>

<li>What's more
I met the questions when I was writing my CV, the CV modified from the template from ModernCV, so here is some other details:
<ol class="org-ol">
<li>When using the template, you may find too many space around the page or the left list may be too narrow for words
<div class="org-src-container">

<pre class="src src-latex">\setlength{\hintscolumnwidth}{0.15\textwidth}
</pre>
</div>
<p>
By using this, you may feel there is more space.
</p>
</li>
<li>How to add github icon on your CV, that's why I want to use fontawesome, there are also a lot other icons included.
<div class="org-src-container">

<pre class="src src-latex">\extrainfo{\faGithub \href{https://github.com/[yourUsername]}{github.com/[yourUsername]}}
</pre>
</div>
<p>
You can do the same thing as I did, put it at the same place as phone numbers, It will appear everywhere needed~
</p>
</li>
</ol>
</li>
</ol>

<p>
A little trial of org-mode.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2017-02-14 Tue 23:20&gt;</span></span></p>
<p class="author">Author: Junjun Shi</p>
<p class="date">Created: 2017-02-14 Tue 23:38</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
